[Killed] BlockStatement
src/Roller.ts:10:32
     // faces (inclusive). Any invalid values should default to 2 to represent 
     // the common coin flip. All numbers in this class should be truncated as
     // an integer if any non-integer number is provided.
-    constructor(faces: number) {
-        //to ensure if the value is in the valid range.
-        this._faces = Math.max(2, Math.min(20, Math.trunc(faces)));
-        
-        this._distribution = new Map<number, number>();
-        for (let i=1; i<=this._faces; i++){
-            this._distribution.set(i,0);
-        }
-    }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 
killedBy: Roller tests constructor should create a Roller with 2 faces if no value is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] BlockStatement
src/Roller.ts:30:32
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number{
-        //to ensure the value is within the valid range
-        value = value < 1 ? 1 : value;
-        value = value > this._faces ? this._faces : value;
-        const rVal = Math.trunc(value);
-
-        //to update the distribution map and last roll value
-        if(rVal >= 1 && rVal <= this._faces){
-            this._distribution.set(rVal, this._distribution.get(rVal)! + 1);
-            this._last = rVal;
-        }
-
-        return this._last;
-    }
+    roll(value: number): number{}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: Roller tests should return the value of the rolled number and update the distribution for a valid roll
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ConditionalExpression
src/Roller.ts:32:17
     //      of rolls for that face by 1
     roll(value: number): number{
         //to ensure the value is within the valid range
-        value = value < 1 ? 1 : value;
+        value = true ? 1 : value;
         value = value > this._faces ? this._faces : value;
         const rVal = Math.trunc(value);
killedBy: Roller tests should return the value of the rolled number and update the distribution for a valid roll
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 1

[Killed] EqualityOperator
src/Roller.ts:32:17
     //      of rolls for that face by 1
     roll(value: number): number{
         //to ensure the value is within the valid range
-        value = value < 1 ? 1 : value;
+        value = value >= 1 ? 1 : value;
         value = value > this._faces ? this._faces : value;
         const rVal = Math.trunc(value);
killedBy: Roller tests should return the value of the rolled number and update the distribution for a valid roll
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 1

[Killed] ConditionalExpression
src/Roller.ts:33:17
     roll(value: number): number{
         //to ensure the value is within the valid range
         value = value < 1 ? 1 : value;
-        value = value > this._faces ? this._faces : value;
+        value = true ? this._faces : value;
         const rVal = Math.trunc(value);
 
killedBy: Roller tests should return the value of the rolled number and update the distribution for a valid roll
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 6

[Killed] EqualityOperator
src/Roller.ts:33:17
     roll(value: number): number{
         //to ensure the value is within the valid range
         value = value < 1 ? 1 : value;
-        value = value > this._faces ? this._faces : value;
+        value = value <= this._faces ? this._faces : value;
         const rVal = Math.trunc(value);
 
killedBy: Roller tests should return the value of the rolled number and update the distribution for a valid roll
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 6

[Killed] EqualityOperator
src/Roller.ts:37:25
         const rVal = Math.trunc(value);
 
         //to update the distribution map and last roll value
-        if(rVal >= 1 && rVal <= this._faces){
+        if(rVal >= 1 && rVal > this._faces){
             this._distribution.set(rVal, this._distribution.get(rVal)! + 1);
             this._last = rVal;
killedBy: Roller tests should return the value of the rolled number and update the distribution for a valid roll
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] EqualityOperator
src/Roller.ts:37:12
         const rVal = Math.trunc(value);
 
         //to update the distribution map and last roll value
-        if(rVal >= 1 && rVal <= this._faces){
+        if(rVal < 1 && rVal <= this._faces){
             this._distribution.set(rVal, this._distribution.get(rVal)! + 1);
             this._last = rVal;
killedBy: Roller tests should return the value of the rolled number and update the distribution for a valid roll
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ArithmeticOperator
src/Roller.ts:38:42
 
         //to update the distribution map and last roll value
         if(rVal >= 1 && rVal <= this._faces){
-            this._distribution.set(rVal, this._distribution.get(rVal)! + 1);
+            this._distribution.set(rVal, this._distribution.get(rVal)! - 1);
             this._last = rVal;
         }
killedBy: Roller tests should return the value of the rolled number and update the distribution for a valid roll
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1
